app/controllers/blog_posts_controller.rb

    def index
        @blog_posts = BlogPost.all
---
SELECT "blog_posts".* FROM "blog_posts"

    def create
        # @blog_post = BlogPost.new(params[:blog_post])
        @blog_post = BlogPost.new(blog_post_params)
        if @blog_post.save
---
INSERT INTO "blog_posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "hello again"], ["body", "the rhie"], ["created_at", "2023-07-21 10:50:00.132881"], ["updated_at", "2023-07-21 10:50:00.132881"]]

    def update
        if @blog_post.update(blog_post_params)
---
UPDATE "blog_posts" SET "title" = ?, "updated_at" = ? WHERE "blog_posts"."id" = ?  [["title", "lil wayne 2"], ["updated_at", "2023-07-21 10:51:35.138143"], ["id", 5]]

    def destroy
        @blog_post.destroy
---
DELETE FROM "blog_posts" WHERE "blog_posts"."id" = ?  [["id", 5]]

    def set_blog_post
        @blog_post = BlogPost.find(params[:id])
---
SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]